W8D1/Reddit 2/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def is_moderator_of_sub?
        @sub = Sub.find(params[:id])

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def update
        @sub = Sub.find(params[:id])