W8D1/Reddit 2/app/models/user.rb

    def self.find_by_credentials(username, pw)
        @user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "estelle"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = SecureRandom::base64(64)
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "5Mpd5I8HNB2AXrNaOfx22TyqJjhFaIdANj9+cPbZTX+KrotXuONG5U3xbwlEFauta8sZVfAHm/zScWmeNVUwIg=="], ["updated_at", "2020-09-14 21:54:59.302319"], ["id", 2]]