W7D3/Music_App/app/controllers/bands_controller.rb

    def create
        @band = Band.new(band_params)
        debugger
        if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "The Pigs"], ["created_at", "2020-09-09 22:18:52.293334"], ["updated_at", "2020-09-09 22:18:52.293334"]]

    def update
        @band = Band.find(params[:id])
        debugger
        if @band.update(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "The Porkchoppiers"], ["updated_at", "2020-09-09 23:15:56.530919"], ["id", 2]]